simulation_results_90cases/pattern_27_upwind/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "5";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
96305
(
(0.0993325 -5.00435e-05 0.00240203)
(0.0982344 -0.000146538 0.00303025)
(0.0971076 -0.000238735 0.0028008)
(0.0960424 -0.000323744 0.00249562)
(0.0951632 -0.000388184 0.00223536)
(0.094455 -0.000429515 0.00201381)
(0.0938594 -0.000467762 0.00182845)
(0.0933646 -0.000513722 0.00168117)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    ground
    {
        type            noSlip;
    }
    atmosphere
    {
        type            slip;
    }
    debris
    {
        type            noSlip;
    }
}


// ************************************************************************* //
